{
    "architectures": [
      "DeepseekV2ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "auto_map": {
      "AutoConfig": "DeepseekV2FastConfig",
      "AutoModel": "DeepseekV2ModelFast",
      "AutoModelForCausalLM": "DeepseekV2ForCausalLM"
    },
    "aux_loss_alpha": 0.0001,
    "aux_loss_free_gamma": 0.0,
    "bos_token_id": 0,
    "eos_token_id": 1,
    "ep_size": 1,
    "first_k_dense_replace": 3,
    "hidden_act": "silu",
    "hidden_size": 7168,
    "initializer_range": 0.02,
    "intermediate_size": 18432,
    "kv_lora_rank": 512,
    "max_position_embeddings": 163840,
    "model_type": "deepseek_v3",
    "moe_intermediate_size": 2048,
    "moe_layer_freq": 1,
    "n_group": 8,
    "n_routed_experts": 8,
    "n_shared_experts": 1,
    "norm_topk_prob": true,
    "num_attention_heads": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 29,
    "num_key_value_heads": 128,
    "num_nextn_predict_layers": 1,
    "num_nextn_predict_lambda": 0.1,
    "pretraining_tp": 1,
    "q_lora_rank": 1536,
    "qk_nope_head_dim": 128,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "beta_fast": 32,
      "beta_slow": 1,
      "factor": 40,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 4096,
      "type": "yarn"
    },
    "rope_theta": 10000,
    "routed_scaling_factor": 2.5,
    "scoring_func": "sigmoid",
    "seq_aux": true,
    "tie_word_embeddings": false,
    "topk_group": 4,
    "topk_method": "noaux_tc",
    "dtype": "bfloat16",
    "transformers_version": "4.33.1",
    "use_cache": true,
    "v_head_dim": 128,
    "vocab_size": 129280,
    "using_flex_token": true,
    "fuse_rms_norm": true,
    "fuse_attention_ffn": true,
    "apply_rope_fusion": true,
    "token_drop_steps": 0,
    "recompute_fwd_gate_up": true,
    "adaptive_remained_O1_recompute_ratio": 0,
    "using_post_norm_recompute": true,
    "is_split_group_gemm": false,
    "use_dualpipev": true,
    "send_mtp_embed": false,
    "mlp_fwd_subbatch_rows": 0,
    "mlp_bwd_subbatch_rows": 65536,    
    "output_subbatch_rows": 2048,
    "dsv3_use_fp8_gemm": true,
    "dsv3_use_atten_recompute": true,
    "use_ds_gemm": false,
    "dsv3_use_fp8_dispatch": true,
    "fa_version": 3,
    "recompute_fa3": true,
    "stepped_recompute_fwd_gate_up": true
  }